SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_bufc.h
/**************************************************************************//**
 * @file
 * @brief EFR32MG22 BUFC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32MG22_BUFC_H
#define EFR32MG22_BUFC_H
#define BUFC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32MG22_BUFC BUFC
 * @{
 * @brief EFR32MG22 BUFC Register Declaration.
 *****************************************************************************/

/** BUFC BUF Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< Buffer Control                                     */
  __IOM uint32_t ADDR;                               /**< Buffer Address                                     */
  __IOM uint32_t WRITEOFFSET;                        /**< Write Offset                                       */
  __IOM uint32_t READOFFSET;                         /**< Read Offset                                        */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IM uint32_t  READDATA;                           /**< Buffer Read Data                                   */
  __IOM uint32_t WRITEDATA;                          /**< Buffer Write Data                                  */
  __IOM uint32_t XWRITE;                             /**< Buffer XOR Write                                   */
  __IM uint32_t  STATUS;                             /**< Buffer Status Register                             */
  __IOM uint32_t THRESHOLDCTRL;                      /**< Threshold Control                                  */
  __IOM uint32_t CMD;                                /**< Buffer Command                                     */
  __IOM uint32_t FIFOASYNC;                          /**< New Register                                       */
  __IM uint32_t  READDATA32;                         /**< Buffer Read Data                                   */
  __IOM uint32_t WRITEDATA32;                        /**< Buffer Write Data                                  */
  __IOM uint32_t XWRITE32;                           /**< Buffer XOR Write                                   */
  uint32_t       RESERVED1[1U];                      /**< Reserved for future use                            */
} BUFC_BUF_TypeDef;

/** BUFC Register Declaration. */
typedef struct {
  __IM uint32_t    IPVERSION;                   /**< IP Version                                         */
  __IOM uint32_t   EN;                          /**< Enable peripheral clock to this module             */
  __IOM uint32_t   LPMODE;                      /**< Low power mode control                             */
  BUFC_BUF_TypeDef BUF[4U];                     /**< Data Buffer                                        */
  uint32_t         RESERVED0[2U];               /**< Reserved for future use                            */
  __IOM uint32_t   IF;                          /**< BUFC Interrupt Flags                               */
  __IOM uint32_t   IEN;                         /**< Interrupt Enable Register                          */
  __IOM uint32_t   SEQIF;                       /**< M0P BUFC Interrupt Flags                           */
  __IOM uint32_t   SEQIEN;                      /**< M0P Interrupt Enable Register                      */
  uint32_t         RESERVED1[1U];               /**< Reserved for future use                            */
  uint32_t         RESERVED2[950U];             /**< Reserved for future use                            */
  __IM uint32_t    IPVERSION_SET;               /**< IP Version                                         */
  __IOM uint32_t   EN_SET;                      /**< Enable peripheral clock to this module             */
  __IOM uint32_t   LPMODE_SET;                  /**< Low power mode control                             */
  BUFC_BUF_TypeDef BUF_SET[4U];                 /**< Data Buffer                                        */
  uint32_t         RESERVED3[2U];               /**< Reserved for future use                            */
  __IOM uint32_t   IF_SET;                      /**< BUFC Interrupt Flags                               */
  __IOM uint32_t   IEN_SET;                     /**< Interrupt Enable Register                          */
  __IOM uint32_t   SEQIF_SET;                   /**< M0P BUFC Interrupt Flags                           */
  __IOM uint32_t   SEQIEN_SET;                  /**< M0P Interrupt Enable Register                      */
  uint32_t         RESERVED4[1U];               /**< Reserved for future use                            */
  uint32_t         RESERVED5[950U];             /**< Reserved for future use                            */
  __IM uint32_t    IPVERSION_CLR;               /**< IP Version                                         */
  __IOM uint32_t   EN_CLR;                      /**< Enable peripheral clock to this module             */
  __IOM uint32_t   LPMODE_CLR;                  /**< Low power mode control                             */
  BUFC_BUF_TypeDef BUF_CLR[4U];                 /**< Data Buffer                                        */
  uint32_t         RESERVED6[2U];               /**< Reserved for future use                            */
  __IOM uint32_t   IF_CLR;                      /**< BUFC Interrupt Flags                               */
  __IOM uint32_t   IEN_CLR;                     /**< Interrupt Enable Register                          */
  __IOM uint32_t   SEQIF_CLR;                   /**< M0P BUFC Interrupt Flags                           */
  __IOM uint32_t   SEQIEN_CLR;                  /**< M0P Interrupt Enable Register                      */
  uint32_t         RESERVED7[1U];               /**< Reserved for future use                            */
  uint32_t         RESERVED8[950U];             /**< Reserved for future use                            */
  __IM uint32_t    IPVERSION_TGL;               /**< IP Version                                         */
  __IOM uint32_t   EN_TGL;                      /**< Enable peripheral clock to this module             */
  __IOM uint32_t   LPMODE_TGL;                  /**< Low power mode control                             */
  BUFC_BUF_TypeDef BUF_TGL[4U];                 /**< Data Buffer                                        */
  uint32_t         RESERVED9[2U];               /**< Reserved for future use                            */
  __IOM uint32_t   IF_TGL;                      /**< BUFC Interrupt Flags                               */
  __IOM uint32_t   IEN_TGL;                     /**< Interrupt Enable Register                          */
  __IOM uint32_t   SEQIF_TGL;                   /**< M0P BUFC Interrupt Flags                           */
  __IOM uint32_t   SEQIEN_TGL;                  /**< M0P Interrupt Enable Register                      */
  uint32_t         RESERVED10[1U];              /**< Reserved for future use                            */
} BUFC_TypeDef;
/** @} End of group EFR32MG22_BUFC */

/**************************************************************************//**
 * @addtogroup EFR32MG22_BUFC
 * @{
 * @defgroup EFR32MG22_BUFC_BitFields BUFC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for BUFC IPVERSION */
#define _BUFC_IPVERSION_RESETVALUE                           0x00000001UL                             /**< Default value for BUFC_IPVERSION            */
#define _BUFC_IPVERSION_MASK                                 0xFFFFFFFFUL                             /**< Mask for BUFC_IPVERSION                     */
#define _BUFC_IPVERSION_IPVERSION_SHIFT                      0                                        /**< Shift value for BUFC_IPVERSION              */
#define _BUFC_IPVERSION_IPVERSION_MASK                       0xFFFFFFFFUL                             /**< Bit mask for BUFC_IPVERSION                 */
#define _BUFC_IPVERSION_IPVERSION_DEFAULT                    0x00000001UL                             /**< Mode DEFAULT for BUFC_IPVERSION             */
#define BUFC_IPVERSION_IPVERSION_DEFAULT                     (_BUFC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for BUFC_IPVERSION     */

/* Bit fields for BUFC EN */
#define _BUFC_EN_RESETVALUE                                  0x00000000UL               /**< Default value for BUFC_EN                   */
#define _BUFC_EN_MASK                                        0x00000001UL               /**< Mask for BUFC_EN                            */
#define BUFC_EN_EN                                           (0x1UL << 0)               /**< Enable peripheral clock to this module      */
#define _BUFC_EN_EN_SHIFT                                    0                          /**< Shift value for BUFC_EN                     */
#define _BUFC_EN_EN_MASK                                     0x1UL                      /**< Bit mask for BUFC_EN                        */
#define _BUFC_EN_EN_DEFAULT                                  0x00000000UL               /**< Mode DEFAULT for BUFC_EN                    */
#define BUFC_EN_EN_DEFAULT                                   (_BUFC_EN_EN_DEFAULT << 0) /**< Shifted mode DEFAULT for BUFC_EN            */

/* Bit fields for BUFC LPMODE */
#define _BUFC_LPMODE_RESETVALUE                              0x00000000UL                          /**< Default value for BUFC_LPMODE               */
#define _BUFC_LPMODE_MASK                                    0x00000003UL                          /**< Mask for BUFC_LPMODE                        */
#define BUFC_LPMODE_LPENBYSEQ                                (0x1UL << 0)                          /**< Low power mode enable from M0p sequencer    */
#define _BUFC_LPMODE_LPENBYSEQ_SHIFT                         0                                     /**< Shift value for BUFC_LPENBYSEQ              */
#define _BUFC_LPMODE_LPENBYSEQ_MASK                          0x1UL                                 /**< Bit mask for BUFC_LPENBYSEQ                 */
#define _BUFC_LPMODE_LPENBYSEQ_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for BUFC_LPMODE                */
#define BUFC_LPMODE_LPENBYSEQ_DEFAULT                        (_BUFC_LPMODE_LPENBYSEQ_DEFAULT << 0) /**< Shifted mode DEFAULT for BUFC_LPMODE        */
#define BUFC_LPMODE_LPENBYM33                                (0x1UL << 1)                          /**< Low power mode enable from M33              */
#define _BUFC_LPMODE_LPENBYM33_SHIFT                         1                                     /**< Shift value for BUFC_LPENBYM33              */
#define _BUFC_LPMODE_LPENBYM33_MASK                          0x2UL                                 /**< Bit mask for BUFC_LPENBYM33                 */
#define _BUFC_LPMODE_LPENBYM33_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for BUFC_LPMODE                */
#define BUFC_LPMODE_LPENBYM33_DEFAULT                        (_BUFC_LPMODE_LPENBYM33_DEFAULT << 1) /**< Shifted mode DEFAULT for BUFC_LPMODE        */

